In [15]:
import pandas as pd
import numpy as np

In [14]:
pip install openpyxl

Collecting openpyxl
  Downloading openpyxl-3.1.5-py2.py3-none-any.whl.metadata (2.5 kB)
Collecting et-xmlfile (from openpyxl)
  Downloading et_xmlfile-1.1.0-py3-none-any.whl.metadata (1.8 kB)
Downloading openpyxl-3.1.5-py2.py3-none-any.whl (250 kB)
Downloading et_xmlfile-1.1.0-py3-none-any.whl (4.7 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-1.1.0 openpyxl-3.1.5
Note: you may need to restart the kernel to use updated packages.

In [16]:
df = pd.read_excel("Sample.xlsx")

In [17]:
df

     Id First Name Last Name      City Gender  Age
0   110       Abhi     Mohan       Goa      M   25
1   111        Joe    Jordan     Delhi      F   26
2   112        Sam     Peter    Mumbai      M   21
3   113        Alt    balaji    bhopal      F   29
4   114     Albert  Discosta      Pune      M   28
5   115        Ram       Jha  New York      M   31
6   116      Shyam    Sunder    Indore      M   24
7   117      Alvin       Roy     Mandi      F   27
8   118      Binoj    Sharma     Kullu      F   31
9   119     Rajesh     Kumar     Delhi      M   25
10  120   Ashutosh    Tiwari       Goa      M   24

In [18]:
df.head()

    Id First Name Last Name    City Gender  Age
0  110       Abhi     Mohan     Goa      M   25
1  111        Joe    Jordan   Delhi      F   26
2  112        Sam     Peter  Mumbai      M   21
3  113        Alt    balaji  bhopal      F   29
4  114     Albert  Discosta    Pune      M   28

In [19]:
type(df)

pandas.core.frame.DataFrame

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Id          11 non-null     int64
 1   First Name  11 non-null     object
 2   Last Name   11 non-null     object
 3   City        11 non-null     object
 4   Gender      11 non-null     object
 5   Age         11 non-null     int64
dtypes: int64(2), object(4)
memory usage: 660.0+ bytes

In [21]:
df.describe()

               Id        Age
count   11.000000  11.000000
mean   115.000000  26.454545
std      3.316625   3.110101
min    110.000000  21.000000
25%    112.500000  24.500000
50%    115.000000  26.000000
75%    117.500000  28.500000
max    120.000000  31.000000

In [22]:
## Indexing

In [23]:
df["First Name"]

0         Abhi
1          Joe
2          Sam
3          Alt
4       Albert
5          Ram
6        Shyam
7        Alvin
8        Binoj
9       Rajesh
10    Ashutosh
Name: First Name, dtype: object

In [24]:
df[["First Name"]]

   First Name
0        Abhi
1         Joe
2         Sam
3         Alt
4      Albert
5         Ram
6       Shyam
7       Alvin
8       Binoj
9      Rajesh
10   Ashutosh

In [26]:
df[["First Name","Last Name","Age"]]  # to call multiple columns

   First Name Last Name  Age
0        Abhi     Mohan   25
1         Joe    Jordan   26
2         Sam     Peter   21
3         Alt    balaji   29
4      Albert  Discosta   28
5         Ram       Jha   31
6       Shyam    Sunder   24
7       Alvin       Roy   27
8       Binoj    Sharma   31
9      Rajesh     Kumar   25
10   Ashutosh    Tiwari   24

In [27]:
## Series has either 1 row or 1 columns whereas DataFrame can have more than 1 rows and columns.

In [30]:
df.loc[[0,1,2,3,4,5]]

    Id First Name Last Name      City Gender  Age
0  110       Abhi     Mohan       Goa      M   25
1  111        Joe    Jordan     Delhi      F   26
2  112        Sam     Peter    Mumbai      M   21
3  113        Alt    balaji    bhopal      F   29
4  114     Albert  Discosta      Pune      M   28
5  115        Ram       Jha  New York      M   31

In [31]:
df.loc[[5,6,7]]

    Id First Name Last Name      City Gender  Age
5  115        Ram       Jha  New York      M   31
6  116      Shyam    Sunder    Indore      M   24
7  117      Alvin       Roy     Mandi      F   27

In [32]:
df.loc[["First Name"]]

KeyError: "None of [Index(['First Name'], dtype='object')] are in the [index]"

In [35]:
df.iloc[:,[0,1]]

     Id First Name
0   110       Abhi
1   111        Joe
2   112        Sam
3   113        Alt
4   114     Albert
5   115        Ram
6   116      Shyam
7   117      Alvin
8   118      Binoj
9   119     Rajesh
10  120   Ashutosh

In [36]:
df.iloc[[1,2],[1,2]]

  First Name Last Name
1        Joe    Jordan
2        Sam     Peter

In [37]:
## converting data frame into arrays

In [38]:
df.head()

    Id First Name Last Name    City Gender  Age
0  110       Abhi     Mohan     Goa      M   25
1  111        Joe    Jordan   Delhi      F   26
2  112        Sam     Peter  Mumbai      M   21
3  113        Alt    balaji  bhopal      F   29
4  114     Albert  Discosta    Pune      M   28

In [40]:
df.iloc[:,[0,4,5]].values

array([[110, 'M', 25],
       [111, 'F', 26],
       [112, 'M', 21],
       [113, 'F', 29],
       [114, 'M', 28],
       [115, 'M', 31],
       [116, 'M', 24],
       [117, 'F', 27],
       [118, 'F', 31],
       [119, 'M', 25],
       [120, 'M', 24]], dtype=object)

In [41]:
## Basic Operations

In [42]:
df.isnull()

       Id  First Name  Last Name   City  Gender    Age
0   False       False      False  False   False  False
1   False       False      False  False   False  False
2   False       False      False  False   False  False
3   False       False      False  False   False  False
4   False       False      False  False   False  False
5   False       False      False  False   False  False
6   False       False      False  False   False  False
7   False       False      False  False   False  False
8   False       False      False  False   False  False
9   False       False      False  False   False  False
10  False       False      False  False   False  False

In [43]:
df.isnull().sum()

Id            0
First Name    0
Last Name     0
City          0
Gender        0
Age           0
dtype: int64

In [45]:
df["City"].value_counts()

City
Goa         2
Delhi       2
Mumbai      1
bhopal      1
Pune        1
New York    1
Indore      1
Mandi       1
Kullu       1
Name: count, dtype: int64

In [46]:
df["Gender"].value_counts()

Gender
M    7
F    4
Name: count, dtype: int64

In [48]:
df["Gender"].unique()

array(['M', 'F'], dtype=object)

In [49]:
df["First Name"].unique()

array(['Abhi', 'Joe', 'Sam', 'Alt', 'Albert', 'Ram', 'Shyam', 'Alvin',
       'Binoj', 'Rajesh', 'Ashutosh'], dtype=object)

In [51]:
df["Age"]>25

0     False
1      True
2     False
3      True
4      True
5      True
6     False
7      True
8      True
9     False
10    False
Name: Age, dtype: bool

In [52]:
df[df["Age"]>25]

    Id First Name Last Name      City Gender  Age
1  111        Joe    Jordan     Delhi      F   26
3  113        Alt    balaji    bhopal      F   29
4  114     Albert  Discosta      Pune      M   28
5  115        Ram       Jha  New York      M   31
7  117      Alvin       Roy     Mandi      F   27
8  118      Binoj    Sharma     Kullu      F   31

In [57]:
df[df["Age"]>25][["First Name","Last Name","Age"]]

  First Name Last Name  Age
1        Joe    Jordan   26
3        Alt    balaji   29
4     Albert  Discosta   28
5        Ram       Jha   31
7      Alvin       Roy   27
8      Binoj    Sharma   31

In [58]:
df.shape

(11, 6)

In [59]:
mod_df = df[df["Age"]>25][["First Name","Last Name","Age"]]

In [61]:
mod_df.to_csv("modified file.csv", index=False)